{"/about/de/blog/":{"data":{"":"Comming soon."},"title":"Blog"},"/about/de/contact/":{"data":{"":" Colin SchmaleSülldorfer Mühlenweg 34\n22589 Hamburg\nDeutschland E-Mailsupport@warreportmail.app "},"title":"Contact"},"/about/de/discord/":{"data":{"":"Join my Discord server for support \u0026 giveaways."},"title":"discord"},"/about/de/docs/":{"data":{"":"Welcome to the War Report documentation. Explore all features and learn how to use the app. Please also take a look at the FAQ.\nWhether you are managing Clan Wars, climbing the leaderboard of the Legends League, or aiming for a promotion of your clan in the Clan War League. War Report equips you with the tools to always stay one step ahead of your opponents. The app is completely free to use and adheres to the Safe and Fair Play Policy of the game by only using data from the official Clash of Clans API.","need-help#Need help?":"If you have any questions, please join my Discord server or send me an email to support@warreportmail.app."},"title":"Docs"},"/about/de/docs/faq/":{"data":{"":"","can-my-account-get-banned-for-using-this-app#Can my account get banned for using this app?":"No. The app only uses data provided to us by Supercell. For more information you can visit https://developer.clashofclans.com.","is-this-app-from-supercell#Is this app from Supercell?":"This material is unofficial and is not endorsed by Supercell. For more information see Supercell’s Fan Content Policy: https://supercell.com/fan-content-policy.","why-are-there-no-legend-league-stats-for-my-account#Why are there no Legend League stats for my account?":"","why-isnt-the-data-exactly-up-to-date#Why isn\u0026rsquo;t the data exactly up to date?":"Why are there no Legend League stats for my account? The Legend League data is provided by the ClashKing Discord bot, which manages a large database with most of the players in the Legend League. However, it may happen that a player is not yet known to ClashKing. To add a player to this database, please use the command ‘/legends search’ in the chat of my Discord server.\nWhy isn’t the data exactly up to date? The app retrieves data from the Clash of Clans API, which is cached. This can cause minor delays in displaying the latest updates. The table below shows the caching duration for API responses.\nType Caching Time Players 1 minute Clans 2 minutes Clan Wars 2 minutes Clan War League 10 minutes "},"title":"FAQ"},"/about/de/docs/features/":{"data":{"":"Explore the following sections to learn more about the features of War Report.\nPlayers Clans Clan Wars Clan War League Legend League Account "},"title":"Features"},"/about/de/docs/features/account/":{"data":{"":"You can create an account in the app settings. An account allows you to sync your bookmarks and settings across multiple devices. Additional features will be introduced in the future."},"title":"Account"},"/about/de/docs/features/clan_war_league/":{"data":{"":"If a clan war belongs to the Clan War League, you will find a button at the bottom of the clan war page that will take you to the clan war league page. For additional information about a clan or player, click on an item in the group or player list.","past-seasons#Past seasons":"The app also provides details of past Clan War League seasons. Simply click on an entry in the war log to view them. Please note that some Clan War League months may not have been tracked by ClashKing."},"title":"Clan War League"},"/about/de/docs/features/clan_wars/":{"data":{"":"The war tab displays ongoing clan wars of your bookmarked players and clans. Use the filter in the top right corner if you only want to see specific war types. You can also remove clans or players for which you don’t want to see ongoing wars. If you have many bookmarks, loading the list may take longer, so use the filter to select the wars you are interested in. As soon as a player or clan is at war, you will also find a button at the bottom of the player or clan page that will take you to the clan war page.\nFor friendly wars and regular clan wars, your clan must have a public war log. If your war log is private, ask your leader to change the clan settings. For the Clan War League, a public war log is not required.","past-wars#Past wars":"The app also provides details of past clan wars. Simply click on an entry in the war log to view them. Please note that some clan wars may not have been tracked by ClashKing."},"title":"Clan Wars"},"/about/de/docs/features/clans/":{"data":{"":"Clan details, such as a list of all members and the number of wins, losses, and ties in clan wars, are displayed on the clan page. For additional information, click one of the buttons in the top-right corner to access pages with detailed statistics on recent Clan Wars and the Legends League.","bookmark-clans#Bookmark clans":"Bookmark your favorite clans by clicking the bookmark button in the top-right corner of their detail page. To remove a bookmark, simply click the button again or swipe the clan entry in your bookmarks list to the left or right. You can also rearrange your bookmarks to keep them organized: tap and hold any item, then drag it to the desired position.","search-clans#Search clans":"To search a clan, click on the button in the bottom right corner of the clans page. You can search players by tag or by name.\nThe image below shows where you can find the clan tag. Click on your experience (1) to open your profile, then click on your clan (2), and then copy the tag (3) below your name."},"title":"Clans"},"/about/de/docs/features/legend_league/":{"data":{"":"Access Legend League statistics by clicking the trophy buttons on the player and clan pages. The Legend League data is provided by the ClashKing Discord bot, which manages a large database with most of the players in the Legend League. However, it may happen that a player is not yet known to ClashKing. To add a player to this database, please use the command ‘/legends search’ in the chat of my Discord server."},"title":"Legend League"},"/about/de/docs/features/players/":{"data":{"":"Player details, such as hero and troop levels, are displayed on the player page. For additional information, click one of the buttons in the top-right corner to access pages with detailed statistics on recent Clan Wars and the Legends League.","bookmark-players#Bookmark players":"Bookmark your favorite players by clicking the bookmark button in the top-right corner of their detail page. To remove a bookmark, simply click the button again or swipe the player entry in your bookmarks list to the left or right. You can also rearrange your bookmarks to keep them organized: tap and hold any item, then drag it to the desired position.","search-players#Search players":"To search a player, click on the button in the bottom right corner of the players page. You can search players by tag or by name. The search by name is based on data provided by the ClashKing Discord bot and may not include all players.\nThe image below shows where you can find the player tag. Click on your experience (1) to open your profile (2), and then copy the tag (3) below your name."},"title":"Players"},"/about/de/privacy_policy/":{"data":{"":"","authentifizierung#Authentifizierung":"War Report bietet einen Login über eine Kombination von E-Mail und Passwort oder Discord OAuth2 an. Wenn Sie ein Konto erstellen oder sich mit diesen Methoden anmelden, werden die folgenden Informationen in meiner Datenbank gespeichert: E-Mail-Adresse, Passwort, Discord-Benutzer-ID. Diese Informationen sind erforderlich, um Ihnen Zugang zu Ihrem Konto zu gewähren und ihre Daten geräteübergreifend zu synchronisieren. Diese Informationen werden nicht an Dritte weitergegeben.","datenschutzbeauftragter#Datenschutzbeauftragter":"Colin Schmale\nSülldorfer Mühlenweg 34\n22589 Hamburg\nDeutschland","e-mail#E-Mail":"support@warreportmail.app","fehlerüberwachung#Fehlerüberwachung":"Sentry wird zur Überwachung von Fehlern, Abstürzen und Leistungsproblemen der Anwendung verwendet. Es hilft technische Probleme zu ermitteln und zu beheben, indem es anonymisierte Daten wie Geräte- und Browserdetails sammelt. Sentry ist so konfiguriert, dass keine persönlich identifizierbaren Informationen wie die IP-Adresse oder der Standort des Nutzers gesammelt werden. Alle Daten, die an Sentry weitergegeben werden, werden auf EU Servern gespeichert und sicher und in Übereinstimmung mit unseren Datenschutzrichtlinien behandelt. Weitere Einzelheiten darüber, wie Sentry mit Daten umgeht, finden Sie in deren Datenschutzerklärung.","rechte-des-nutzers-auskunft-berichtung-und-löschung#Rechte des Nutzers: Auskunft, Berichtung und Löschung":"Auf Antrag erhalten Sie als Nutzer unentgeltlich Auskunft darüber, welche personenbezogenen Daten über Sie gespeichert wurden. Sie haben ein Recht auf Berichtigung unrichtiger Daten sowie auf Sperrung oder Löschung Ihrer personenbezogenen Daten.","umfang#Umfang":"Diese Datenschutzerklärung soll die Nutzer dieser App über Art, Umfang und Zweck der Erhebung und Verwendung personenbezogener Daten durch den App-Betreiber Colin Schmale, Sülldorfer Mühlenweg 34, 22589 Hamburg, Deutschland, informieren. Der App-Betreiber nimmt Ihren Datenschutz sehr ernst und behandelt Ihre personenbezogenen Daten vertraulich und entsprechend der gesetzlichen Vorschriften. Er möchte, dass Sie wissen, wann er welche Daten erhebt und wie er sie verwendet. Er hat technische und organisatorische Maßnahmen getroffen, um sicherzustellen, dass die datenschutzrechtlichen Bestimmungen sowohl von ihm als auch von externen Dienstleistern eingehalten werden. Im Zuge der Weiterentwicklung seiner App und der Implementierung neuer Technologien, um den Service für Sie zu verbessern, können auch Änderungen dieser Datenschutzerklärung erforderlich werden. Er empfiehlt Ihnen daher, diese Datenschutzerklärung von Zeit zu Zeit erneut zu lesen.","umgang-mit-kontaktdaten#Umgang mit Kontaktdaten":"Nehmen Sie mit dem App-Betreiber durch die angebotenen Kontaktmöglichkeiten Verbindung auf, werden Ihre Angaben gespeichert, damit auf diese zur Bearbeitung und Beantwortung Ihrer Anfrage zurückgegriffen werden kann. Diese Daten werden ohne Ihre Einwilligung nicht an Dritte weitergegeben.","zugriffsdaten#Zugriffsdaten":"Es werden Daten über Zugriffe auf den Webserver des App-Betreibers erhoben und als „Server-Logfiles“ gespeichert. Folgende Daten werden so protokolliert: Besuchte Website, Uhrzeit des Zugriffs, verwendetes Betriebssystem und IP-Adresse. Die erhobenen Daten werden nur zur Verbesserung der App und zur Fehlererkennung verwendet. Der App-Betreiber behält sich jedoch vor, die Server-Logfiles nachträglich zu überprüfen, sollten konkrete Anhaltspunkte auf eine rechtswidrige Nutzung hinweisen."},"title":"Privacy Policy"}}