{"/about/de/blog/":{"data":{"":"Kommt bald."},"title":"Blog"},"/about/de/contact/":{"data":{"":" Colin SchmaleSülldorfer Mühlenweg 34\n22589 Hamburg\nDeutschland E-Mailsupport@warreportmail.app "},"title":"Contact"},"/about/de/discord/":{"data":{"":"Erhalte Hilfe zur App und nimm an Gewinnspielen auf meinem Discord-Server teil."},"title":"discord"},"/about/de/docs/":{"data":{"":"Willkommen bei der Dokumentation zu War Report. Entdecke alle Funktionen und lerne, wie du die App benutzt. Bitte wirf auch einen Blick auf die FAQ.\nEgal, ob du Clankriege verwaltest, die Rangliste der Legenden-Liga erklimmst oder einen Aufstieg deines Clans in der Clankriegsliga anstrebst. War Report gibt dir die Werkzeuge an die Hand, um deinen Gegnern immer einen Schritt voraus zu sein. Die App ist komplett kostenlos und hält sich an die Safe und Fair Play Richtlinien des Spiels, indem sie nur Daten aus der offiziellen Clash of Clans API verwendet.","benötigst-du-hilfe#Benötigst du Hilfe?":"Falls du Fragen hast, tritt bitte meinem Discord server bei oder schicke mir eine E-Mail an support@warreportmail.app."},"title":"Doku"},"/about/de/docs/faq/":{"data":{"":"","ist-diese-app-von-supercell#Ist diese App von Supercell?":"Dieses Material ist inoffiziell und wird nicht von Supercell gebilligt. Weitere Informationen findest du in Supercells Richtlinien für Fan-Inhalte: https://supercell.com/fan-content-policy.","kann-mein-konto-wegen-der-nutzung-dieser-app-gesperrt-werden#Kann mein Konto wegen der Nutzung dieser App gesperrt werden?":"Nein. Die App verwendet nur Daten, die uns von Supercell zur Verfügung gestellt werden. Für weitere Informationen besuche bitte https://developer.clashofclans.com.","warum-gibt-es-keine-legendenliga-statistiken-für-meinen-account#Warum gibt es keine Legendenliga-Statistiken für meinen Account?":"Die Daten der Legenden-Liga werden vom ClashKing-Discord-Bot bereitgestellt, der eine große Datenbank mit den meisten Spielern der Legenden-Liga verwaltet. Es kann jedoch vorkommen, dass ein Spieler bei ClashKing noch nicht bekannt ist. Um einen Spieler zu dieser Datenbank hinzuzufügen, benutze bitte den Befehl ‘/legends search’ im Chat meines Discord-Servers.","warum-sind-die-daten-nicht-auf-dem-neuesten-stand#Warum sind die Daten nicht auf dem neuesten Stand?":"Die App ruft Daten von der Clash of Clans-API ab, die im Cache gespeichert sind. Dies kann zu kleinen Verzögerungen bei der Anzeige der neuesten Updates führen. Die folgende Tabelle zeigt die Caching-Dauer für API-Antworten.\nTyp Caching-Zeit Spieler 1 Minute Clans 2 Minuten Clankriege 2 Minuten Clan-Kriegsliga 10 Minuten "},"title":"FAQ"},"/about/de/docs/features/":{"data":{"":"In den folgenden Abschnitten erfährst du mehr über die Funktionen der App.\nSpieler Clans Clankriege Clankriegsliga Legenden Liga Konto "},"title":"Funktionen"},"/about/de/docs/features/account/":{"data":{"":"Du kannst in den Einstellungen der App ein Konto erstellen. Mit einem Konto kannst du deine Lesezeichen und Einstellungen zwischen mehreren Geräten synchronisieren. Die App wird in der Zukunft um zusätzliche Funktionen erweitert werden."},"title":"Konto"},"/about/de/docs/features/clan_war_league/":{"data":{"":"Wenn ein Clankrieg zur Clankriegsliga gehört, findest du unten auf der Clankriegsseite eine Schaltfläche, die dich zur Clankriegsligaseite führt. Für weitere Informationen über einen Clan oder einen Spieler, klicke auf einen Eintrag in der Gruppen- oder Spielerliste.","vergangene-saison#Vergangene Saison":"Die App bietet auch Details zu vergangenen Monaten der Clankriegsliga. Klicke einfach auf einen Eintrag im Kriegsprotokoll, um sie anzusehen. Bitte beachte, dass einige Monate möglicherweise nicht von ClashKing aufgezeichnet wurden."},"title":"Clankriegsliga"},"/about/de/docs/features/clan_wars/":{"data":{"":"Unter „Clankriege“ werden die laufenden Clankriege der von dir mit Lesezeichen versehenen Spieler und Clans angezeigt. Verwende den Filter in der oberen rechten Ecke, wenn du nur bestimmte Kriegstypen sehen möchten. Du kannst auch Clans oder Spieler entfernen, von denen du keine laufenden Kriege sehen möchtest. Wenn du viele Lesezeichen hast, kann das Laden der Liste länger dauern. Verwende daher den Filter, um die Kriege auszuwählen, an denen du interessiert bist. Sobald sich ein Spieler oder Clan im Krieg befindet, findest du unten auf der Spieler- oder Clanseite eine Schaltfläche, die dich zur Clankriegsseite führt.\nFür Freundschaftskriege und reguläre Clankriege muss dein Clan ein öffentliches Kriegsprotokoll haben. Wenn dein Kriegsprotokoll privat ist, bitte deinen Anführer, die Claneinstellungen zu ändern. Für die Clankriegsliga ist ein öffentliches Kriegsprotokoll nicht erforderlich.","vergangene-kriege#Vergangene Kriege":"Die App bietet auch Details zu vergangenen Clankriegen. Klicke einfach auf einen Eintrag im Kriegsprotokoll, um sie zu sehen. Bitte beachte, dass einige Clankriege möglicherweise nicht von ClashKing aufgezeichnet wurden."},"title":"Clankriege"},"/about/de/docs/features/clans/":{"data":{"":"Clan details, such as a list of all members and the number of wins, losses, and ties in clan wars, are displayed on the clan page. For additional information, click one of the buttons in the top-right corner to access pages with detailed statistics on recent Clan Wars and the Legends League.","clans-speichern#Clans speichern":"Setze ein Lesezeichen für deine Lieblingsclans, indem du auf die Schaltfläche „Lesezeichen“ in der oberen rechten Ecke der Detailseite des Clans klickst. Um ein Lesezeichen zu entfernen, klicke einfach erneut auf die Schaltfläche oder streiche den Clan in deiner Lesezeichenliste nach links oder rechts. Du kannst deine Lesezeichen auch neu anordnen: Tippe auf ein beliebiges Element, halte es gedrückt und ziehe es dann an die gewünschte Position.","clans-suchen#Clans suchen":"Um einen Clan zu suchen, klicke auf die Schaltfläche in der unteren rechten Ecke der Clanseite. Du kannst Clans mit deren Kürzel oder Namen suchen.\nDas Bild unten zeigt, wo du das Clankürzel findest. Klicke auf deine Erfahrung (1), um dein Profil zu öffnen (2), klicke dann auf deinen Clan (2), und kopiere dann das Kürzel (3) unter dem Namen deines Clans."},"title":"Clans"},"/about/de/docs/features/legend_league/":{"data":{"":"Schaue dir Statistiken zur Legendenliga an, indem du auf die Schaltfläche oben rechts auf einer Spieler- oder Clanseite klickst. Die Daten der Legenden-Liga werden vom ClashKing Discord-Bot bereitgestellt, der eine große Datenbank mit den meisten Spielern der Legenden-Liga verwaltet. Es kann jedoch vorkommen, dass ein Spieler bei ClashKing noch nicht bekannt ist. Um einen Spieler zu dieser Datenbank hinzuzufügen, benutze bitte den Befehl ‘/legends search’ im Chat meines Discord-Servers."},"title":"Legenden-Liga"},"/about/de/docs/features/players/":{"data":{"":"Spielerdetails, wie z.B. die Helden- und Truppenstufen, werden auf der Spielerseite angezeigt. Für zusätzliche Informationen klicke auf eine der Schaltflächen in der oberen rechten Ecke, um Seiten mit detaillierten Statistiken zu den letzten Clankriegen und der Legendenliga aufzurufen.","spieler-speichern#Spieler speichern":"Setze ein Lesezeichen für deine Lieblingsspieler, indem du auf die Schaltfläche „Lesezeichen“ in der oberen rechten Ecke der Detailseite des Spielers klickst. Um ein Lesezeichen zu entfernen, klicke einfach erneut auf die Schaltfläche oder streiche den Spieler in deiner Lesezeichenliste nach links oder rechts. Du kannst deine Lesezeichen auch neu anordnen: Tippe auf ein beliebiges Element, halte es gedrückt und ziehe es dann an die gewünschte Position.","spieler-suchen#Spieler suchen":"Um einen Spieler zu suchen, klicke auf die Schaltfläche in der unteren rechten Ecke der Spielerseite. Du kannst Spieler mit deren Kürzel oder Namen suchen. Die Suche nach Namen basiert auf Daten, die vom ClashKing Discord-Bot bereitgestellt werden, und umfasst möglicherweise nicht alle Spieler.\nDas Bild unten zeigt, wo du das Spielerkürzel findest. Klicke auf deine Erfahrung (1), um dein Profil zu öffnen (2), und kopiere dann das Kürzel (3) unter deinem Namen."},"title":"Spieler"},"/about/de/privacy_policy/":{"data":{"":"","authentifizierung#Authentifizierung":"War Report bietet einen Login über eine Kombination von E-Mail und Passwort oder Discord OAuth2 an. Wenn Sie ein Konto erstellen oder sich mit diesen Methoden anmelden, werden die folgenden Informationen in meiner Datenbank gespeichert: E-Mail-Adresse, Passwort, Discord-Benutzer-ID. Diese Informationen sind erforderlich, um Ihnen Zugang zu Ihrem Konto zu gewähren und ihre Daten geräteübergreifend zu synchronisieren. Diese Informationen werden nicht an Dritte weitergegeben.","datenschutzbeauftragter#Datenschutzbeauftragter":"Colin Schmale\nSülldorfer Mühlenweg 34\n22589 Hamburg\nDeutschland","e-mail#E-Mail":"support@warreportmail.app","fehlerüberwachung#Fehlerüberwachung":"Sentry wird zur Überwachung von Fehlern, Abstürzen und Leistungsproblemen der Anwendung verwendet. Es hilft technische Probleme zu ermitteln und zu beheben, indem es anonymisierte Daten wie Geräte- und Browserdetails sammelt. Sentry ist so konfiguriert, dass keine persönlich identifizierbaren Informationen wie die IP-Adresse oder der Standort des Nutzers gesammelt werden. Alle Daten, die an Sentry weitergegeben werden, werden auf EU Servern gespeichert und sicher und in Übereinstimmung mit unseren Datenschutzrichtlinien behandelt. Weitere Einzelheiten darüber, wie Sentry mit Daten umgeht, finden Sie in deren Datenschutzerklärung.","rechte-des-nutzers-auskunft-berichtung-und-löschung#Rechte des Nutzers: Auskunft, Berichtung und Löschung":"Auf Antrag erhalten Sie als Nutzer unentgeltlich Auskunft darüber, welche personenbezogenen Daten über Sie gespeichert wurden. Sie haben ein Recht auf Berichtigung unrichtiger Daten sowie auf Sperrung oder Löschung Ihrer personenbezogenen Daten.","umfang#Umfang":"Diese Datenschutzerklärung soll die Nutzer dieser App über Art, Umfang und Zweck der Erhebung und Verwendung personenbezogener Daten durch den App-Betreiber Colin Schmale, Sülldorfer Mühlenweg 34, 22589 Hamburg, Deutschland, informieren. Der App-Betreiber nimmt Ihren Datenschutz sehr ernst und behandelt Ihre personenbezogenen Daten vertraulich und entsprechend der gesetzlichen Vorschriften. Er möchte, dass Sie wissen, wann er welche Daten erhebt und wie er sie verwendet. Er hat technische und organisatorische Maßnahmen getroffen, um sicherzustellen, dass die datenschutzrechtlichen Bestimmungen sowohl von ihm als auch von externen Dienstleistern eingehalten werden. Im Zuge der Weiterentwicklung seiner App und der Implementierung neuer Technologien, um den Service für Sie zu verbessern, können auch Änderungen dieser Datenschutzerklärung erforderlich werden. Er empfiehlt Ihnen daher, diese Datenschutzerklärung von Zeit zu Zeit erneut zu lesen.","umgang-mit-kontaktdaten#Umgang mit Kontaktdaten":"Nehmen Sie mit dem App-Betreiber durch die angebotenen Kontaktmöglichkeiten Verbindung auf, werden Ihre Angaben gespeichert, damit auf diese zur Bearbeitung und Beantwortung Ihrer Anfrage zurückgegriffen werden kann. Diese Daten werden ohne Ihre Einwilligung nicht an Dritte weitergegeben.","zugriffsdaten#Zugriffsdaten":"Es werden Daten über Zugriffe auf den Webserver des App-Betreibers erhoben und als „Server-Logfiles“ gespeichert. Folgende Daten werden so protokolliert: Besuchte Website, Uhrzeit des Zugriffs, verwendetes Betriebssystem und IP-Adresse. Die erhobenen Daten werden nur zur Verbesserung der App und zur Fehlererkennung verwendet. Der App-Betreiber behält sich jedoch vor, die Server-Logfiles nachträglich zu überprüfen, sollten konkrete Anhaltspunkte auf eine rechtswidrige Nutzung hinweisen."},"title":"Privacy Policy"}}