{"/about/blog/clan_war_league_medals/":{"data":{"":"Medals from Clan War Leagues are split into base medals, which every roster player can earn, and bonus medals, which leaders can award at the end of the week.\nBase medals depend on the league tier, the clan’s final placement, and the stars a player earns. Each player receives a percentage of the clan’s maximum medal payout based on their total stars across the 7 wars.","bonus-medals#Bonus medals":"League Medals per bonus Number of bonuses Unranked 0 0 Bronze League III 35 1 Bronze League II 35 1 Bronze League I 35 1 Silver League III 35 1 Silver League II 40 1 Silver League I 45 1 Gold League III 50 2 Gold League II 55 2 Gold League I 60 2 Crystal League III 65 2 Crystal League II 70 2 Crystal League I 75 2 Master League III 80 3 Master League II 85 3 Master League I 90 3 Champion League III 95 4 Champion League II 100 4 Champion League I 105 4 Too difficult? Let War Report do the math for you.","medals-for-clan-position#Medals for clan position":"League 1st 2nd 3rd 4th 5th 6th 7th 8th Unranked 0 0 0 0 0 0 0 0 Bronze League III 34 32 30 28 26 24 22 20 Bronze League II 46 44 42 40 38 36 34 32 Bronze League I 58 56 54 52 50 48 46 44 Silver League III 76 73 70 67 64 61 58 55 Silver League II 94 91 88 85 82 79 76 73 Silver League I 112 109 106 103 100 97 94 91 Gold League III 136 132 128 124 120 116 112 108 Gold League II 160 156 152 148 144 140 136 132 Gold League I 184 180 176 172 168 164 160 156 Crystal League III 214 209 204 199 194 189 184 179 Crystal League II 244 239 234 229 224 219 214 209 Crystal League I 274 269 264 259 254 249 244 239 Master League III 310 304 298 292 286 280 274 268 Master League II 346 340 334 328 322 316 310 304 Master League I 382 376 370 364 358 352 346 340 Champion League III 424 417 410 403 396 389 382 375 Champion League II 466 459 452 445 438 431 424 417 Champion League I 508 501 494 487 480 473 466 459 Bonus medals are tied directly to league tier and the number of wars your clan wins. Each tier has a guaranteed number of bonus slots with a fixed medal value per slot, and every war win adds one additional bonus slot on top of that guaranteed amount."},"title":"How are Clan War League medals calculated?"},"/about/blog/events/":{"data":{"":"The following table provides an overview of the most important recurring events in Clash of Clans and their typical dates and times in UTC.\nEvent Frequency Date Clan War Leagues Monthly Sign-up starts on 1st of the month (8:00AM UTC) Clan Games Monthly 22nd - 28th (8:00AM UTC) Gold Pass Season Monthly Season starts on 1st of the month (8:00AM UTC) Legend League Monthly Season resets on the last Monday of the month (5:00AM UTC) Ranked Leagues Weekly Sign-up starts on Monday (05:00AM UTC) Raid Weekend Weekly From Friday to Monday (7:00AM UTC) Trader Weekly Offers reset every Tuesday (8:00AM UTC)"},"title":"Events"},"/about/blog/glossary/":{"data":{"":"A collection of frequently used Clash of Clans terms and abbreviations. It serves as a quick reference for both new and experienced players.\nTerm Definition Alt Alternate account of a player AQ Archer Queen BH Builder Hall BK Barbarian King CC Clan Castle CG Clan Games CW Clan War Charge One or more heroes are sent deep into the base to destroy key defenses or cc Coco loon Single Balloon sent ahead to trigger seeking air mines before main air troops or Healers CW Clan War CWL Clan War League DE Dark Elixir Dip Higher Town Hall attacking a lower Town Hall in war DPS Damage per second Engineering Keeping some defenses low or missing to reduce war weight while upgrading offense EQ Earthquake F2P Free‑to‑play player who spends no real money Farm (defence) Cluster of identical defenses such as Tesla farm or X‑Bow farm Farm(ing) Playing mainly to gain resources instead of trophies FC Friendly Challenge Funnel(ling) Removing outside buildings so troops or heroes walk into the base instead of around it Gemmer Player who progresses quickly by spending real money (gems) Global chat Removed worldwide chat channel that previously matched random players and helped find clans HP Hit points; total health of a troop or building Island Defense surrounded by empty space so troops can’t reach it Kill squad Small group of troops and heroes used to remove enemy Queen, Clan Castle, or key defenses at the beginning of an attack Meta “Most Effective Tactics Available”; often used for the strongest attack strategies Mirror Attacking the enemy base with the same map position number as your own in war Nerf Balance change that makes a troop, spell, or defense weaker Push Attacking to gain trophies and climb leagues Rushing Upgrading the Town Hall before heroes, troops, buildings and walls are fully upgraded Scout Attack used to reveal traps, pathing, and CC troops of a base Skelly Donut Skeleton or bat spells with rage and invisibility to destroy multiple defenses and clan castle in the core of the base Swag Dropping unnecessary spells/troops at the end of a guaranteed 3‑star to show overkill Tag Unique ID starting with # used to identify a specific clan or player Teaser base Base that exposes the Town Hall or major value to “bait” attackers into a trap‑heavy side TH Town Hall Tile Basic distance unit used for ranges and building sizes Troll Tesla Hidden Tesla placed in an unexpected corner or outside tile to waste time or surprise attackers WB Wall Breaker Walk Queen and / or Grand Warden with Healers clearing mostly outside buildings and creating a funnel War weight ”Strength” value of a base used for war matchmaking, driven by defenses, heroes, and troops"},"title":"Glossary"},"/about/blog/raid_weekend_rewards/":{"data":{"":"Each destroyed district adds a reward based on its Capital Hall or District Hall level. The offensive reward can be calculated by adding up the rewards for completely destroyed districts, dividing this value by the number of attacks, and multiplying it by 6.\nCapital Hall Level Reward 2 180 3 360 4 585 5 810 6 1115 7 1240 8 1260 9 1375 10 1450 District Hall Level Reward 1 135 2 225 3 350 4 405 5 460 Too difficult? Let War Report do the math for you."},"title":"How are Raid Weekend rewards calculated?"},"/about/contact/":{"data":{"":"Colin SchmaleSülldorfer Mühlenweg 34\n22589 Hamburg\nGermany Emailsupport@warreportmail.app"},"title":"Contact"},"/about/discord/":{"data":{"":"Join my Discord server for support \u0026 giveaways."},"title":"discord"},"/about/docs/":{"data":{"":"Welcome to the War Report documentation. Explore all features and learn how to use the app. Please also take a look at the FAQ.\nWhether you are managing Clan Wars, climbing the leaderboard of the Legends League, or aiming for a promotion of your clan in the Clan War League. War Report equips you with the tools to always stay one step ahead of your opponents. The app is completely free to use and adheres to the Safe and Fair Play Policy of the game by only using data from the official Clash of Clans API .","need-help#Need help?":"If you have any questions, please join my Discord server or send me an email to support@warreportmail.app."},"title":"Docs"},"/about/docs/faq/":{"data":{"":"","can-my-account-get-banned-for-using-this-app#Can my account get banned for using this app?":"No. The app only uses data provided to us by Supercell. For more information you can visit https://developer.clashofclans.com .","how-can-i-support-you#How can I support you?":"Unfortunately, I do not yet have a Creator Code. However, you are very welcome to help me by translating the app into additional languages. I would also greatly appreciate a positive review on Google Play or the App Store , or you could simply tell your clan about the app if you enjoy using it.","is-this-app-from-supercell#Is this app from Supercell?":"This material is unofficial and is not endorsed by Supercell. For more information see Supercell’s Fan Content Policy: https://supercell.com/fan-content-policy .","why-are-there-no-legend-league-stats-for-my-account#Why are there no Legend League stats for my account?":"The app only tracks players while they are in the top 200 of their country. Unfortunately, it is not possible for me to track more players. I do not generate any revenue from the app, and to track all players in the game would be associated with significant costs.","why-isnt-the-data-exactly-up-to-date#Why isn\u0026rsquo;t the data exactly up to date?":"The app retrieves data from the Clash of Clans API, which is cached. This can cause minor delays in displaying the latest updates. The table below shows the caching duration for API responses.\nType Caching Time Players 1 minute Clans 2 minutes Clan Wars 2 minutes Clan War League 10 minutes"},"title":"FAQ"},"/about/docs/features/":{"data":{"":"Explore the following sections to learn more about the features of War Report.\nPlayers Clans Clan Wars Clan War League Legend League Account"},"title":"Features"},"/about/docs/features/account/":{"data":{"":"Creating an account in the app settings unlocks additional features.","cross-device-sync#Cross-Device Sync":"Your bookmarked players, clans, and other settings are automatically synchronized across all devices where you’re signed in. This makes it easy to switch between your phone and tablet without losing track of your favorite clans and players.","notifications#Notifications":"Accounts enable push notifications to keep you informed about important clan activities. For example, you will receive a notification if you still need to attack in war, helping you never miss your chance to contribute. Notification preferences can be customized in the app settings to match your needs."},"title":"Account"},"/about/docs/features/clan_capital/":{"data":{"":"Click the menu button in the top right corner of the clan page to access this information. This page tracks your clan’s Clan Capital performance, showing detailed statistics for each raid weekend. The Summary tab displays overall metrics and the attacks of your members. You can switch to the Attacks or Defenses tabs to see details about the performance of clans and districts."},"title":"Clan Capital"},"/about/docs/features/clan_war_league/":{"data":{"":"If a clan war belongs to the Clan War League, you will find a button at the bottom of the clan war page that will take you to the clan war league page. For additional information about a clan or player, click on an item in the group or player list.","past-seasons#Past seasons":"The app also provides details of past Clan War League seasons. Simply click on an entry in the war log to view them. The data is provided by the ClashKing Discord bot. Please note that some Clan War League months may not have been tracked by ClashKing."},"title":"Clan War League"},"/about/docs/features/clan_wars/":{"data":{"":"The war tab displays ongoing clan wars of your bookmarked players and clans. Use the filter in the top right corner if you only want to see specific war types. You can also remove clans or players for which you don’t want to see ongoing wars. If you have many bookmarks, loading the list may take longer, so use the filter to select the wars you are interested in. As soon as a player or clan is at war, you will also find a button at the bottom of the player or clan page that will take you to the clan war page.\nFor friendly wars and regular clan wars, your clan must have a public war log. If your war log is private, ask your leader to change the clan settings. For the Clan War League, a public war log is not required.","past-wars#Past wars":"The app also provides details of past clan wars. Simply click on an entry in the war log to view them. The data is provided by the ClashKing Discord bot. Please note that some clan wars may not have been tracked by ClashKing."},"title":"Clan Wars"},"/about/docs/features/clans/":{"data":{"":"Clan details, such as a list of all members and the number of wins, losses, and ties in clan wars, are displayed on the clan page. For additional information, click one of the buttons in the top-right corner to access pages with detailed statistics on recent Clan Wars and the Legends League.","bookmark-clans#Bookmark clans":"Bookmark your favorite clans by clicking the bookmark button in the top-right corner of their detail page. To remove a bookmark, simply click the button again or swipe the clan entry in your bookmarks list to the left or right. You can also rearrange your bookmarks to keep them organized: tap and hold any item, then drag it to the desired position.","details#Details":"","raid-weekend#Raid Weekend":"This page tracks your clan’s Clan Capital performance, showing detailed statistics for each raid weekend.","search-clans#Search clans":"To search a clan, click on the button in the bottom right corner of the clans page. You can search clans by tag or by name.\nThe image below shows where you can find the clan tag. Click on your experience (1) to open your profile, then click on your clan (2), and then copy the tag (3) below your name.","stats#Stats":"The Stats page presents aggregated war and CWL performance statistics over a selected time period for the clan and all of its members.","war-log#War log":"This page displays the clan’s Clan War war and CWL results."},"title":"Clans"},"/about/docs/features/legend_league/":{"data":{"":"Click the button in the top right corner of the clan page to access this information. This page displays the player’s Legend League performance for the current and previous seasons. It shows trophies gained and lost per day along with a graph visualizing trophy progression throughout the month.\nThe information may not include all attacks and defenses. The app only tracks players while they are in the top 200 of their country."},"title":"Legend League"},"/about/docs/features/players/":{"data":{"":"Player details, such as hero and troop levels, are displayed on the player page. For additional information, click one of the buttons in the top-right corner to access pages with detailed statistics on recent Clan Wars and the Legends League.","achievements#Achievements":"The Achievements page displays the player’s progress across all in-game achievements, organized by category (Home Village, Builder Base, Clan Capital).","attacks#Attacks":"This page provides a complete history of all clan war and CWL attacks and defenses of the player. Use the filter at the top to include or exclude friendly wars.","bookmark-players#Bookmark players":"Bookmark your favorite players by clicking the bookmark button in the top-right corner of their detail page. To remove a bookmark, simply click the button again or swipe the player entry in your bookmarks list to the left or right. You can also rearrange your bookmarks to keep them organized: tap and hold any item, then drag it to the desired position.","details#Details":"","legend-league#Legend League":"This page displays the player’s Legend League performance for the current and previous seasons.","previous-clans#Previous Clans":"This page shows previous clans the player has been a member of and the total time spent in each clan.","search-players#Search players":"To search a player, click on the button in the bottom right corner of the players page. You can search players by tag or by name. The search by name is based on data provided by the ClashKing Discord bot and may not include all players.\nThe image below shows where you can find the player tag. Click on your experience (1) to open your profile (2), and then copy the tag (3) below your name.","stats#Stats":"The Stats page presents aggregated war and CWL performance statistics over a selected time period."},"title":"Players"},"/about/privacy_policy/":{"data":{"":"","access-data#Access data":"Data about access to the app operators web server is collected and saved as “server log files”. The following data is logged in this way: website visited, time of access, operating system used and IP address. The data collected is only used to improve the app and for error detection. However, the app operator reserves the right to check the server log files retrospectively if there are specific indications of illegal use.","authentification#Authentification":"War Report provides the option to log in using either a combination of email and password or Discord OAuth2. When you create an account or log in through these methods, I collect and store the following information in my database: email address, password, Discord user ID. This data is essential so I can authenticate you and synchronize your data across devices. This information is not shared with any third parties.","data-protection-officer#Data protection officer":"Colin Schmale\nSülldorfer Mühlenweg 34\n22589 Hamburg\nGermany","email#Email":"support@warreportmail.app","error-monitoring#Error Monitoring":"Sentry is used to track errors, crashes and performance issues of the app. It helps diagnose and fix technical problems by collecting anonymized data such as device and browser details. Sentry is configured to not collect any personally identifiable information like the IP address or location of the user. Any data shared with Sentry is stored on EU servers and handled securely and in accordance with our privacy practices. For more details on how Sentry processes data, please refer to their privacy policy.","handling-of-contact-data#Handling of contact data":"If you contact the app operator through the contact options offered, your details will be saved so that they can be used to process and answer your request. Without your consent, this data will not be passed on to third parties.","rights-of-the-user-information-correction-and-deletion#Rights of the user: information, correction and deletion":"Upon request, you as a user will receive free information about which personal data has been stored about you. You have the right to correct incorrect data and to have your personal data blocked or deleted.","scope#Scope":"This data protection declaration is intended to inform the users of this app about the type, scope and purpose of the collection and use of personal data by the app operator Colin Schmale, Sülldorfer Mühlenweg 34, 22589 Hamburg, Germany. The app operator takes your data protection very seriously and treats your personal data confidentially and in accordance with legal regulations. He wants you to know when he collects which data and how he uses it. He has taken technical and organizational measures to ensure that data protection regulations are observed both by him and by external service providers. In the course of the further development of his app and the implementation of new technologies to improve the service for you, changes to this data protection declaration may also be necessary. He therefore recommends that you read this data protection declaration again from time to time."},"title":"Privacy Policy"}}