{"/about/blog/":{"data":{"":"Comming soon."},"title":"Blog"},"/about/contact/":{"data":{"":" Colin SchmaleSülldorfer Mühlenweg 34\n22589 Hamburg\nGermany Emailsupport@warreportmail.app "},"title":"Contact"},"/about/discord/":{"data":{"":"Join my Discord server for support \u0026 giveaways."},"title":"discord"},"/about/docs/":{"data":{"":"Welcome to the War Report documentation. Explore all features and learn how to use the app. Please also take a look at the FAQ.\nWhether you are managing Clan Wars, climbing the leaderboard of the Legends League, or aiming for a promotion of your clan in the Clan War League. War Report equips you with the tools to always stay one step ahead of your opponents. The app is completely free to use and adheres to the Safe and Fair Play Policy of the game by only using data from the official Clash of Clans API.","need-help#Need help?":"If you have any questions, please join my Discord server or send me an email to support@warreportmail.app."},"title":"Docs"},"/about/docs/faq/":{"data":{"":"","can-my-account-get-banned-for-using-this-app#Can my account get banned for using this app?":"No. The app only uses data provided to us by Supercell. For more information you can visit https://developer.clashofclans.com.","is-this-app-from-supercell#Is this app from Supercell?":"This material is unofficial and is not endorsed by Supercell. For more information see Supercell’s Fan Content Policy: https://supercell.com/fan-content-policy.","why-are-there-no-legend-league-stats-for-my-account#Why are there no Legend League stats for my account?":"","why-isnt-the-data-exactly-up-to-date#Why isn\u0026rsquo;t the data exactly up to date?":"Why are there no Legend League stats for my account? The Legend League data is provided by the ClashKing Discord bot, which manages a large database with most of the players in the Legend League. However, it may happen that a player is not yet known to ClashKing. To add a player to this database, please use the command ‘/legends search’ in the chat of my Discord server.\nWhy isn’t the data exactly up to date? The app retrieves data from the Clash of Clans API, which is cached. This can cause minor delays in displaying the latest updates. The table below shows the caching duration for API responses.\nType Caching Time Players 1 minute Clans 2 minutes Clan Wars 2 minutes Clan War League 10 minutes "},"title":"FAQ"},"/about/docs/features/":{"data":{"":"Explore the following sections to learn more about the features of War Report.\nPlayers Clans Clan Wars Clan War League Legend League Account "},"title":"Features"},"/about/docs/features/account/":{"data":{"":"You can create an account in the app settings. An account allows you to sync your bookmarks and settings across multiple devices. Additional features will be introduced in the future."},"title":"Account"},"/about/docs/features/clan_war_league/":{"data":{"":"If a clan war belongs to the Clan War League, you will find a button at the bottom of the clan war page that will take you to the clan war league page. For additional information about a clan or player, click on an item in the group or player list.","past-seasons#Past seasons":"The app also provides details of past Clan War League seasons. Simply click on an entry in the war log to view them. Please note that some Clan War League months may not have been tracked by ClashKing."},"title":"Clan War League"},"/about/docs/features/clan_wars/":{"data":{"":"The war tab displays ongoing clan wars of your bookmarked players and clans. Use the filter in the top right corner if you only want to see specific war types. You can also remove clans or players for which you don’t want to see ongoing wars. If you have many bookmarks, loading the list may take longer, so use the filter to select the wars you are interested in. As soon as a player or clan is at war, you will also find a button at the bottom of the player or clan page that will take you to the clan war page.\nFor friendly wars and regular clan wars, your clan must have a public war log. If your war log is private, ask your leader to change the clan settings. For the Clan War League, a public war log is not required.","past-wars#Past wars":"The app also provides details of past clan wars. Simply click on an entry in the war log to view them. Please note that some clan wars may not have been tracked by ClashKing."},"title":"Clan Wars"},"/about/docs/features/clans/":{"data":{"":"Clan details, such as a list of all members and the number of wins, losses, and ties in clan wars, are displayed on the clan page. For additional information, click one of the buttons in the top-right corner to access pages with detailed statistics on recent Clan Wars and the Legends League.","bookmark-clans#Bookmark clans":"Bookmark your favorite clans by clicking the bookmark button in the top-right corner of their detail page. To remove a bookmark, simply click the button again or swipe the clan entry in your bookmarks list to the left or right. You can also rearrange your bookmarks to keep them organized: tap and hold any item, then drag it to the desired position.","search-clans#Search clans":"To search a clan, click on the button in the bottom right corner of the clans page. You can search players by tag or by name.\nThe image below shows where you can find the clan tag. Click on your experience (1) to open your profile, then click on your clan (2), and then copy the tag (3) below your name."},"title":"Clans"},"/about/docs/features/legend_league/":{"data":{"":"Access Legend League statistics by clicking the trophy buttons on the player and clan pages. The Legend League data is provided by the ClashKing Discord bot, which manages a large database with most of the players in the Legend League. However, it may happen that a player is not yet known to ClashKing. To add a player to this database, please use the command ‘/legends search’ in the chat of my Discord server."},"title":"Legend League"},"/about/docs/features/players/":{"data":{"":"Player details, such as hero and troop levels, are displayed on the player page. For additional information, click one of the buttons in the top-right corner to access pages with detailed statistics on recent Clan Wars and the Legends League.","bookmark-players#Bookmark players":"Bookmark your favorite players by clicking the bookmark button in the top-right corner of their detail page. To remove a bookmark, simply click the button again or swipe the player entry in your bookmarks list to the left or right. You can also rearrange your bookmarks to keep them organized: tap and hold any item, then drag it to the desired position.","search-players#Search players":"To search a player, click on the button in the bottom right corner of the players page. You can search players by tag or by name. The search by name is based on data provided by the ClashKing Discord bot and may not include all players.\nThe image below shows where you can find the player tag. Click on your experience (1) to open your profile (2), and then copy the tag (3) below your name."},"title":"Players"},"/about/privacy_policy/":{"data":{"":"","access-data#Access data":"Data about access to the app operators web server is collected and saved as “server log files”. The following data is logged in this way: website visited, time of access, operating system used and IP address. The data collected is only used to improve the app and for error detection. However, the app operator reserves the right to check the server log files retrospectively if there are specific indications of illegal use.","authentification#Authentification":"War Report provides the option to log in using either a combination of email and password or Discord OAuth2. When you create an account or log in through these methods, I collect and store the following information in my database: email address, password, Discord user ID. This data is essential so I can authenticate you and synchronize your data across devices. This information is not shared with any third parties.","data-protection-officer#Data protection officer":"Colin Schmale\nSülldorfer Mühlenweg 34\n22589 Hamburg\nGermany","email#Email":"support@warreportmail.app","error-monitoring#Error Monitoring":"Sentry is used to track errors, crashes and performance issues of the app. It helps diagnose and fix technical problems by collecting anonymized data such as device and browser details. Sentry is configured to not collect any personally identifiable information like the IP address or location of the user. Any data shared with Sentry is stored on EU servers and handled securely and in accordance with our privacy practices. For more details on how Sentry processes data, please refer to their privacy policy.","handling-of-contact-data#Handling of contact data":"If you contact the app operator through the contact options offered, your details will be saved so that they can be used to process and answer your request. Without your consent, this data will not be passed on to third parties.","rights-of-the-user-information-correction-and-deletion#Rights of the user: information, correction and deletion":"Upon request, you as a user will receive free information about which personal data has been stored about you. You have the right to correct incorrect data and to have your personal data blocked or deleted.","scope#Scope":"This data protection declaration is intended to inform the users of this app about the type, scope and purpose of the collection and use of personal data by the app operator Colin Schmale, Sülldorfer Mühlenweg 34, 22589 Hamburg, Germany. The app operator takes your data protection very seriously and treats your personal data confidentially and in accordance with legal regulations. He wants you to know when he collects which data and how he uses it. He has taken technical and organizational measures to ensure that data protection regulations are observed both by him and by external service providers. In the course of the further development of his app and the implementation of new technologies to improve the service for you, changes to this data protection declaration may also be necessary. He therefore recommends that you read this data protection declaration again from time to time."},"title":"Privacy Policy"}}